Gets the id of the host structural for this rebar.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public ElementId GetHostId()
  Visual Basic
Public Function GetHostId As ElementId
  Visual C++
public:
ElementId^ GetHostId()
 Return Value
 Returns the id of the host structural for this rebar.
 See Also
  RebarUpdateCurvesData Class
  Autodesk.Revit.DB.Structure Namespace